app/controllers/songs_controller.rb

  def index
    artist_id = params[:artist_id]
    if artist_id
      if artist_id.to_i <= Artist.all.last.id && artist_id.to_i != 0
        @songs = Artist.find(params[:artist_id]).songs
      else
        redirect_to(artists_path)
        flash[:alert] = "Artist not found."
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:id].to_i <= Song.all.last.id
      @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]